'''
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
'''
from sys import argv
from itertools import cycle

script_name, chislo = argv
n = []
с = 0
for el in cycle("ABC"):
    if с >= int(chislo):
        break
    n.append(el)
    с += 1
print(n)
