'''
Реализовать программу работы с органическими клетками, состоящими из ячеек. Необходимо
создать класс Клетка. В его конструкторе инициализировать параметр, соответствующий
количеству ячеек клетки (целое число). В классе должны быть реализованы методы
перегрузки арифметических операторов: сложение ( __add__() ), вычитание ( __sub__()) ,
умножение ( __mul__()) , деление ( __truediv__()) . Данные методы должны применяться т олько
к клеткам и выполнять увеличение, уменьшение, умножение и целочисленное (с округлением
до целого) деление клеток, соответственно.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться
сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность
количества ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как
произведение количества ячеек этих двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как
целочисленное деление количества ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и
количество ячеек в ряду. Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида * ****\n*****\n*****. .., где количество ячеек между \ n
равно переданному аргументу. Если ячеек на формирование ряда не хватает, то в последний
ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод
make_order() вернет строку: *****\n*****\n** .
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод
make_order() вернет строку: *****\n*****\n***** .
'''


class Cell:
    def __init__(self, a):
        self.a = int(a)

    def __add__(self, other):
        return self.a + other.a

    def __sub__(self, other):
        if self.a > other.a:
            return self.a - other.a
        else:
            print(f"{self.a} - {other.a}: меньше нуля")

    def __mul__(self, other):
        return int(self.a * other.a)

    def __floordiv__(self, other):
        return int(self.a / other.a)

    def make_order(self, rows):
        row = ''
        for i in range(int(self.a / rows)):
            row += f'{"*" * rows} \n'
        row += f'{"*" * (self.a % rows)}'
        return row


c_1 = Cell(25)
c_2 = Cell(13)
print(c_1.a)
print(c_2.a)
print(c_1 + c_2)
print(c_1 * c_2)
print(c_1 - c_2)
print(c_1 // c_2)
print()
print(c_2.make_order(5))
print()
print(c_1.make_order(4))
